#+ASSIGNMENT: exam-1-2
#+POINTS: 6
#+CATEGORY: exam1
#+RUBRIC: (("technical" . 0.7) ("presentation" . 0.3))
#+DUEDATE: <2015-10-07 Wed 10:20>

A gas-phase reaction 2A \rightarrow B occurs in a plug flow reactor with a volume of 20L, an inlet molar flow of 0.25 mol/min, and an inlet concentration of 0.5 mol/L. A conversion of 80% is achieved.

Estimate the conversion that could be achieved in a 20 L CSTR with the same conditions as the PFR. Make any assumptions necessary, and make sure you explain what they are.

I assume this reactor rate law is ra = k Ca**2
First I need to calculate the rate constant.
#+BEGIN_SRC python
import numpy as np
from scipy.optimize import fsolve

from scipy.integrate import quad

Fa0 = 0.25 # mol/min
Ca0 = 0.5  # mol/L
V = 20    # L
v0 = Fa0/Ca0
X = 0.8
Faexit = Fa0 * 0.2
def func(k):
    def integrand(Fa):
        x = (Fa0-Fa)/(-2)
        Fb = x*1
        Ft = Fa + Fb
        v = v0* Ft/Fa0
        Ca = Fa/v
        ra =  -k * Ca**2
        return 1.0/ra
    def integrade (V):
        return 1.0
    I1,e1 = quad(integrand,Fa0, Faexit)
    I2,e2 = quad(integrade, 0 ,V)
    return I1-I2
guess = 0.1
sol, = fsolve(func, guess)
print ('The k is {} L/(mol*s)'.format(sol))

#+END_SRC

#+RESULTS:
=The k is 0.0192921565674 L/(mol*s)
=So, we now get the rate law: ra = -kCa**2
then go on calculate the conversion in CSTR
#+BEGIN_SRC python
import numpy as np
from scipy.optimize import fsolve
k = 0.01929
Fa0 = 0.25 # mol/min
Ca0 = 0.5  # mol/L
V = 20    # L
v0 = Fa0/Ca0
def func(Fa):
    Ca = Fa/V
    ra = -k* Ca**2
    return Fa0 - Fa + ra*V
guess = 0.2
ans, = fsolve (func,guess)
con = (Fa0-ans)/Fa0
print ('The conversion is {}'.format(con))
#+END_SRC

#+RESULTS:
: The conversion is 0.000241008787518

#+TURNED-IN: Wed Oct  7 10:21:36 2015

* Grade
#+technical: B
#+presentation: B
#+GRADE: 0.700
#+GRADED-BY: 
#+LATE: Your assignment was late. You may be subject to a 50% penalty in the future.
